{
  "backend/main.mo": "Motoko canister with access‑controlled user profiles, admin role assignment, and role/authorization queries.",
  "feature_evidence.json": "Feature evidence report listing features, involved files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend components and utilities.",
  "frontend/DEPLOYMENT_ROOT_CAUSE.md": "Explains the frontend build failure causes and documents the fixes applied to restore successful production deployment.",
  "frontend/index.css": "Global Tailwind stylesheet defining OKLCH color tokens, dark mode variables, and base element styling.",
  "frontend/index.html": "HTML entry point with SEO metadata, social tags, cache‑control headers, and script bootstrapping.",
  "frontend/SMOKE_TEST.md": "Post‑deployment smoke test checklist for verifying UI rendering, assets, interactions, and responsiveness.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with a root layout and marketing page route wrapped in a ThemeProvider.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and iconized UI.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time profile setup that saves a user’s name with validation and toast feedback.",
  "frontend/src/components/layout/Section.tsx": "Reusable layout wrapper rendering section spacing, optional headers, and merged class names using cn().",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with logo, navigation shortcuts, social link, and copyright note.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with navigation, mobile menu toggle, and CTA button.",
  "frontend/src/components/primitives/Button.tsx": "Reusable button component supporting variants, sizes, and custom classes.",
  "frontend/src/components/primitives/Card.tsx": "Card layout primitives providing styled wrappers for headers, content, and footers.",
  "frontend/src/components/sections/AboutSection.tsx": "About section displaying title and descriptive paragraphs from COPY content.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact section with card layout offering email and social media contact links.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with headline, subheadline, CTA buttons, and illustration image.",
  "frontend/src/components/sections/ProcessSection.tsx": "Process overview rendering numbered steps using cards from COPY content.",
  "frontend/src/components/sections/ServicesSection.tsx": "Services grid showing service cards with icons, descriptions, and benefits.",
  "frontend/src/content/copy.ts": "Centralized text content for hero, services, process, about, and contact sections.",
  "frontend/src/content/labels.ts": "Shared UI labels for navigation and CTA text.",
  "frontend/src/hooks/useActor.ts": "Hook creating and managing authenticated or anonymous backend actors with react-query.",
  "frontend/src/hooks/useAdminInquiries.ts": "Empty placeholder file.",
  "frontend/src/hooks/useCreateInquiry.ts": "Empty placeholder file.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the current user's profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useIsCallerAdmin.ts": "Uses react-query to check if the current authenticated caller has admin privileges via the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/src/lib/navigation.ts": "Exports static navigation item definitions using label constants.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminInboxPage.tsx": "Empty placeholder page component for an admin inbox.",
  "frontend/src/pages/MarketingPage.tsx": "Renders the main marketing page composed of multiple section components.",
  "frontend/src/utils/smokeCheck.ts": "Runs basic DOM presence checks for key UI elements and logs results for post-deployment smoke testing.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Metadata file describing project state, known issues, and deployment-related feature requirements."
}