{
  "backend/main.mo": "Motoko backend implementing user profiles with access control and an inquiry system with create, list, and delete operations restricted to admins.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like file containing prewritten one-sentence summaries of all major frontend source files.",
  "frontend/index.css": "Global Tailwind CSS base defining OKLCH color variables, light/dark theme tokens, and default border/background styles.",
  "frontend/index.html": "Main HTML entry point providing SEO metadata, Open Graph/Twitter tags, and script loader for the React app.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router, global layout with header/footer, theming, and admin/marketing routes.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first‑time user profile creation, collecting a name and saving it through a backend mutation.",
  "frontend/src/components/layout/Section.tsx": "Reusable layout wrapper providing consistent spacing and optional title/description headers around content.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying logo, navigation shortcuts, descriptive text, and a Twitter/X link with attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with navigation, admin link, logo, and mobile menu toggle.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with title and descriptive paragraphs from COPY.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form section that submits inquiries, handles validation, and displays success or error alerts.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with headline, subheadline, CTAs, and an illustration, supporting smooth scrolling to sections.",
  "frontend/src/components/sections/ProcessSection.tsx": "Displays a multi-step process using cards populated from COPY.process data.",
  "frontend/src/components/sections/ServicesSection.tsx": "Service listing section showing cards with descriptions and benefits from COPY.services.",
  "frontend/src/content/copy.ts": "Centralized static content for hero, services, process, about, and contact sections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useAdminInquiries.ts": "Hooks for listing and deleting inquiries via the backend actor with React Query.",
  "frontend/src/hooks/useCreateInquiry.ts": "Mutation hook for creating inquiries and invalidating related queries.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks for fetching and saving the current user's profile using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, exposing identity state, login, logout, and status flags.",
  "frontend/src/index.css": "Defines global Tailwind layers and CSS variables for light/dark themes, applying base styling and typography settings.",
  "frontend/src/lib/navigation.ts": "Exports a constant list of navigation items for sections of the site.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AdminInboxPage.tsx": "Implements the admin inquiry inbox with authentication checks, profile setup gating, inquiry listing, and deletion actions.",
  "frontend/src/pages/MarketingPage.tsx": "Renders the main marketing page composed of hero, services, process, about, and contact sections.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors based on CSS vars, typography, animations, and plugins.",
  "project_state.json": "Describes the project state, requirements, features, and metadata for the marketing website."
}