{
  "kind": "build_request",
  "title": "Fix deployment error and successfully deploy the app live",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify the root cause of the previous live deployment failure (“Deployment error”) by reproducing the production deployment locally (or in the CI/deploy environment) and capturing the exact failing step and error output, then apply the minimal code/config changes needed so the same deployment completes successfully.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Try again make it live"
        ]
      },
      "acceptanceCriteria": [
        "A deployment run that previously failed now completes without errors using the same production/live deployment command/process.",
        "The specific root cause is documented in the PR/commit description (what failed, why, and what changed to fix it)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "After the deployment succeeds, perform a post-deploy smoke test of the live site to confirm it is accessible and functional (homepage loads, header/footer render, and the Contact section external links are present).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Try again make it live"
        ]
      },
      "acceptanceCriteria": [
        "Visiting the live URL loads the marketing page without a blank screen or console-fatal errors.",
        "Header and footer are visible, and the Contact section includes links for email, X/Twitter, and Instagram.",
        "No missing critical static asset requests are observed for above-the-fold content (e.g., logo/hero image requests do not 404)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor with all Motoko logic in backend/main.mo; only add backend/migration.mo if existing stable state must be upgraded.",
    "Do not edit files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT (compose them instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to resolving the deployment failure.",
    "Changing authentication providers (must remain Internet Identity).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}